#### Pandas-DataFrame And Series
Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [1]:
import pandas as pd

In [64]:
## Series
##A Pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.

import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [14]:
## Create a Series from dictionary
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [67]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [12]:
## Dataframe
## create a Dataframe from a dictionary({}) of list([])

data={
    'Name':['Rajat','John','Jack'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Rajat   25  Bangalore
1   John   30   New York
2   Jack   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [17]:
## Create a Data frame From a List([]) of Dictionaries({})

data=[
    {'Name':'Souvik','Age':32,'City':'Bangalore'},
    {'Name':'Arnab','Age':31,'City':'Kolkata'},
    {'Name':'Riya','Age':24,'City':'Delhi'},
    {'Name':'Shilpa','Age':30,'City':'Burdwan'}
    
]
df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age       City
0  Souvik   32  Bangalore
1   Arnab   31    Kolkata
2    Riya   24      Delhi
3  Shilpa   30    Burdwan
<class 'pandas.core.frame.DataFrame'>

In [18]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [11]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [68]:
## Create a Data frame From a List of Dictionaries
import pandas as pd
data=[
    {'Name':'Souvik','Age':32,'City':'Bangalore'},
    {'Name':'Arnab','Age':31,'City':'Kolkata'},
    {'Name':'Riya','Age':24,'City':'Delhi'},
    {'Name':'Shilpa','Age':30,'City':'Burdwan'}
    
]
df = pd.DataFrame(data)
df['Age']

0    32
1    31
2    24
3    30
Name: Age, dtype: int64

In [39]:
df['Age']

0    32
1    31
2    24
3    30
Name: Age, dtype: int64

In [70]:
df.loc[1]

Name      Arnab
Age          31
City    Kolkata
Name: 1, dtype: object

In [44]:
df.iloc[0]

Name       Souvik
Age            32
City    Bangalore
Name: 0, dtype: object

In [45]:
df

     Name  Age       City
0  Souvik   32  Bangalore
1   Arnab   31    Kolkata
2    Riya   24      Delhi
3  Shilpa   30    Burdwan

In [47]:
## Accessing a specified element
df.at[3,'Age']

30

In [48]:
df.at[2,'Name']

'Riya'

In [73]:
## Accessing a specified element using iat
df.iat[1,2]

'Kolkata'

In [50]:
df

     Name  Age       City
0  Souvik   32  Bangalore
1   Arnab   31    Kolkata
2    Riya   24      Delhi
3  Shilpa   30    Burdwan

In [51]:
### Data MAnipulation with Dataframe
df

     Name  Age       City
0  Souvik   32  Bangalore
1   Arnab   31    Kolkata
2    Riya   24      Delhi
3  Shilpa   30    Burdwan

In [76]:
## Adding a column
import pandas as pd
data=[
    {'Name':'Souvik','Age':32,'City':'Bangalore'},
    {'Name':'Arnab','Age':31,'City':'Kolkata'},
    {'Name':'Riya','Age':24,'City':'Delhi'},
    {'Name':'Shilpa','Age':30,'City':'Burdwan'}
    
]
df['Salary']=[50000,60000,70000,20000]
df

     Name  Age       City  Salary
0  Souvik   32  Bangalore   50000
1   Arnab   31    Kolkata   60000
2    Riya   24      Delhi   70000
3  Shilpa   30    Burdwan   20000

In [58]:
## Remove a column
df.drop('Salary',axis=1,inplace=True)

In [59]:
df

     Name  Age       City
0  Souvik   32  Bangalore
1   Arnab   31    Kolkata
2    Riya   24      Delhi
3  Shilpa   30    Burdwan

In [77]:
## Add age to the column
df['Age']=df['Age']+5
df

     Name  Age       City  Salary
0  Souvik   37  Bangalore   50000
1   Arnab   36    Kolkata   60000
2    Riya   29      Delhi   70000
3  Shilpa   35    Burdwan   20000

In [79]:
df.drop(1,inplace=True)

KeyError: '[1] not found in axis'

In [62]:
df

     Name  Age     City
1   Arnab   32  Kolkata
2    Riya   25    Delhi
3  Shilpa   31  Burdwan

In [63]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [54]:
# Display the data types of each column
print("Data types:\n", df.dtypes)

# Describe the DataFrame
print("Statistical summary:\n", df.describe())

Data types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [55]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000